print("결과값:5")
print("결과값: 2+3")
# print(결과값: "2+3")
print("결과값:%d" % (2+3))

# 100+200+300
# 용돈 : 600원
print("%d" % (100+200+300))
print("용돈 600원")
print("용돈:%d원" % (100+200+300))

# 10+5=15, 10-5=5
# (10+5),(10-5)
print("10+5=%d,10-5=%d" % (10+5,10-5))

# 년도 : 2026년, 해당 월 : 8월
#2026,8
print("%s년,%s월" % (2026,8))





# 숫자형태에 문자열을 넣으면 에러
# 문자 타입에 숫자를 넣으면 가능
# 문자열 > 실수 > 정수


# # *** 타입별 출력 방법
# print("%d" % 1) # %d: 정수
# print("%f" % 1.5) #%f: 실수
# print("%s""안녕") #%s: 문자열


#주석: #을 붙히면 됨. 주석은 설명문임.
# 모든 줄을 선택 후 ctrl+/ 주석처리됨
#print:출력 명령문
print("안녕하세요.")#print: 출력명령
print(1+1)#수식을 계산함
print("1+1")#있는 그래도 출력
# print(안녕) 
# print("결과값":1+1)#문자, 숫자를 함께 출력이 안됨.
print("결과값:%d" % (1+1))
