#번호, 이름, 국어, 영어, 수학->합계,평균->성적출력
#입력->변수저장->성적출력

####리스트타입 변경####
s=[0,0,0,0,0,0,0]
s[0]=(input("번호를 입력하세요."))
s[1]=input("이름을 입력하세요.")
s[2]=int(input("국어 점수를 입력하세요.")) #kor=int(kor)
s[3]=int(input("영어 점수를 입력하세요."))
s[4]=int(input("수학 점수를 입력하세요."))
s[5]=s[2]+s[3]+s[4]
s[6]=s[5]/3

print("[학생 성적 프로그램]")
print("-"*65)
print("번호\t 이름\t 국어\t 영어\t 수학\t 합계\t 평균\t")
print("-"*65)
#print("{s[0]}\t {s[1]}\t {s[2]}\t {s[3]}\t {s[4]}\t {s[5]}\t {s[6]:.2f}\t"\
    #   .format(no,name,kor,eng,math,total,avg))
print(f"{s[0]}\t {s[1]}\t {s[2]}\t {s[3]}\t {s[4]}\t {s[5]}\t {s[6]:.2f}\t") # 포멧함수
